CSI API ETABS v1
cPointElm.GetLocalAxes Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLocalAxes(
	string Name,
	ref double A,
	ref double B,
	ref double C
)
Function GetLocalAxes (
	Name As String,
	ByRef A As Double,
	ByRef B As Double,
	ByRef C As Double
) As Integer
Dim instance As cPointElm
Dim Name As String
Dim A As Double
Dim B As Double
Dim C As Double
Dim returnValue As Integer
returnValue = instance.GetLocalAxes(Name,
	A, B, C)
int GetLocalAxes(
	String^ Name,
	double% A,
	double% B,
	double% C
)
abstract GetLocalAxes :
        Name : string *
        A : float byref *
        B : float byref *
        C : float byref -> int
Parameters
Name
Type: System.String
A
Type: System.Double
B
Type: System.Double
C
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cPointElm Interface
ETABSv1 Namespace